{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "I-Food",
    "2": "B-Food",
    "3": "B-Drink",
    "4": "I-Drink",
    "5": "B-Cuisine",
    "6": "I-Cuisine"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Cuisine": 5,
    "B-Drink": 3,
    "B-Food": 2,
    "I-Cuisine": 6,
    "I-Drink": 4,
    "I-Food": 1,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.54.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
